Repository: team-unstablers/NoctilucaServer
Catalog: NoctilucaServer/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans

# onboarding.window.subtitle
source: 환영합니다!
en: Welcome!
ja: ようこそ！
zh_hans: 欢迎！

# plugins.auth.NullAuthPlugin.description
source: 항상 인증에 성공하는 'NULL' 인증을 제공합니다. 이 플러그인은 개발 용도로만 사용되어야 합니다.
en: Provides 'NULL' authentication that always succeeds. This plugin should be used for development purposes only.
ja: 常に認証に成功する 'NULL' 認証を提供します。このプラグインは開発用途でのみ使用されるべきです。
zh_hans: 提供总是认证成功的 'NULL' 认证。此插件应仅用于开发目的。

# plugins.auth.NullAuthPlugin.name
source: Null 인증 플러그인 (개발용)
en: Null Auth Plugin (Dev)
ja: Null認証プラグイン （開発用）
zh_hans: Null 认证插件 (开发用)

# plugins.auth.PAMAuthPlugin.description
source: UNIX PAM 기반의 username-password 인증을 제공합니다.
en: Provides UNIX PAM-based username-password authentication.
ja: UNIX PAMベースのユーザー名-パスワード認証を提供します。
zh_hans: 提供基于 UNIX PAM 的用户名-密码认证。

# plugins.auth.PAMAuthPlugin.name
source: PAM 인증 플러그인
en: PAM Auth Plugin
ja: PAM認証プラグイン
zh_hans: PAM 认证插件

# plugins.auth.SimplePasswordAuthPlugin.description
source: SHA-512 + bcrypt 기반의 password-only 인증을 제공합니다. 이 플러그인은 Ricardo Garcia (@rg3) 님이 작성하신 libbcrypt를 기반으로 합니다. @rg3 님의 libbcrypt는 CC0-1.0 라이선스 하에 배포되고 있으며, team unstablers Inc. 에서 Noctiluca Server 개발을 위해 포크한 버전은 https://github.com/team-unstablers/libbcrypt/ 에서 확인하실 수 있습니다.
en: Provides SHA-512 + bcrypt based password-only authentication. This plugin is based on libbcrypt written by Ricardo Garcia (@rg3). @rg3's libbcrypt is distributed under CC0-1.0 license. The forked version by team unstablers Inc. for Noctiluca Server development can be found at https://github.com/team-unstablers/libbcrypt/.
ja: SHA-512 + bcrypt ベースのパスワードのみの認証を提供します。 このプラグインは Ricardo Garcia （@rg3） 氏が作成した libbcrypt に基づいています。 @rg3 氏の libbcrypt は CC0-1.0 ライセンスの下で配布されており、team unstablers Inc. が Noctiluca Server 開発のためにフォークしたバージョンは https://github.com/team-unstablers/libbcrypt/ で確認できます。
zh_hans: 提供基于 SHA-512 + bcrypt 的仅密码认证。 此插件基于 Ricardo Garcia (@rg3) 编写的 libbcrypt。 @rg3 的 libbcrypt 在 CC0-1.0 许可证下分发，team unstablers Inc. 为 Noctiluca Server 开发而 Fork 的版本可以在 https://github.com/team-unstablers/libbcrypt/ 查看。

# plugins.auth.SimplePasswordAuthPlugin.name
source: 간단 비밀번호 인증 플러그인
en: Simple Password Auth Plugin
ja: 簡易パスワード認証プラグイン
zh_hans: 简单密码认证插件

# plugins.auth.SSHAuthPlugin.description
source: SSH 키 기반의 인증을 제공합니다. 이 플러그인은 team unstablers Inc.가 작성한 'Xuanxue' Swift 모듈을 기반으로 합니다. Xuanxue의 소스 코드는 https://github.com/team-unstablers/Xuanxue 에서 확인하실 수 있습니다.
en: Provides SSH key-based authentication. This plugin is based on the 'Xuanxue' Swift module written by team unstablers Inc. The source code for Xuanxue can be found at https://github.com/team-unstablers/Xuanxue.
ja: SSHキーベースの認証を提供します。 このプラグインは team unstablers Inc. が作成した 'Xuanxue' Swiftモジュールに基づいています。 Xuanxueのソースコードは https://github.com/team-unstablers/Xuanxue で確認できます。
zh_hans: 提供基于 SSH 密钥的认证。 此插件基于 team unstablers Inc. 编写的 'Xuanxue' Swift 模块。 Xuanxue 的源代码可以在 https://github.com/team-unstablers/Xuanxue 查看。

# plugins.auth.SSHAuthPlugin.name
source: SSH 인증 플러그인
en: SSH Auth Plugin
ja: SSH認証プラグイン
zh_hans: SSH 认证插件

# projection.codec.resolution_level.hd2k
source: 1440p (2K급)
en: 1440p (2K)
ja: 1440p （2Kクラス）
zh_hans: 1440p (2K 级别)

# projection.codec.resolution_level.hd4k
source: 2160p (4K급)
en: 2160p (4K)
ja: 2160p （4Kクラス）
zh_hans: 2160p (4K 级别)

# projection.codec.resolution_level.hd720p
source: 720p (HD급)
en: 720p (HD)
ja: 720p （HDクラス）
zh_hans: 720p (HD 级别)

# projection.codec.resolution_level.hd1080p
source: 1080p (Full HD급)
en: 1080p (Full HD)
ja: 1080p （フルHDクラス）
zh_hans: 1080p (Full HD 级别)

# projection.codec.resolution_level.sd480p
source: 480p (SD급)
en: 480p (SD)
ja: 480p （SDクラス）
zh_hans: 480p (SD 级别)

# projection.codec.resolution_level.unknown
source: 알 수 없음
en: Unknown
ja: 不明
zh_hans: 未知

# projection.codec.resolution_level.unlimited
source: 제한 없음
en: Unlimited
ja: 制限なし
zh_hans: 无限制

# projection.recorder.type.avfoundation.description
source: AVFoundation 프레임워크를 사용한 기본 화면 레코더입니다. 성능은 좋지 않지만, 호환성이 높습니다.
en: Basic screen recorder using AVFoundation framework. Performance is poor, but compatibility is high.
ja: AVFoundationフレームワークを使用した標準的な画面レコーダーです。パフォーマンスは良くありませんが、互換性は高いです。
zh_hans: 使用 AVFoundation 框架的基本屏幕录制器。虽然性能不佳，但兼容性高。

# projection.recorder.type.avfoundation.display_name
source: AVFoundation 레코더
en: AVFoundation Recorder
ja: AVFoundation レコーダー
zh_hans: AVFoundation 录制器

# projection.recorder.type.null.description
source: 화면 녹화를 수행하지 않고 검은 화면만을 전송하는 더미 레코더입니다. 개발 용도로만 사용하세요.
en: Dummy recorder that sends only a black screen without recording. Use for development purposes only.
ja: 画面録画を行わず、黒い画面のみを送信するダミーレコーダーです。開発用途でのみ使用してください。
zh_hans: 不执行屏幕录制，仅发送黑屏的虚拟录制器。仅供开发使用。

# projection.recorder.type.screencapturekit.description
source: macOS 12.3부터 사용 가능한 고성능 화면 레코더입니다. 잠금 화면 등의 특수한 상황에서는 AVFoundation 레코더로 자동 폴백됩니다.
en: High-performance screen recorder available from macOS 12.3. Automatically falls back to AVFoundation recorder in special situations such as lock screen.
ja: macOS 12.3から利用可能な高性能画面レコーダーです。 ロック画面などの特殊な状況ではAVFoundationレコーダーに自動的にフォールバックします。
zh_hans: macOS 12.3 起可用的高性能屏幕录制器。 在锁屏等特殊情况下，会自动回退到 AVFoundation 录制器。

# projection.recorder.type.screencapturekit.display_name
source: ScreenCaptureKit 레코더
en: ScreenCaptureKit Recorder
ja: ScreenCaptureKit レコーダー
zh_hans: ScreenCaptureKit 录制器

# server.error.invalid_license
source: 시스템에 올바른 라이선스가 설치되어 있지 않습니다.
en: No valid license installed on the system.
ja: システムに正しいライセンスがインストールされていません。
zh_hans: 系统中未安装正确的许可证。

# server.identity_error.autoconf_confirm.message
source: 자동 구성을 다시 실시하면 기존에 생성된 인증서가 전부 삭제되고 새로운 인증서가 생성됩니다.
en: Running auto-configuration again will delete all existing certificates and generate a new one.
ja: 自動構成を再実行すると、既存の証明書がすべて削除され、新しい証明書が作成されます。
zh_hans: 如果重新执行自动配置，现有生成的证书将被全部删除，并创建新证书。

# server.identity_error.autoconf_confirm.no
source: 아니오
en: No
ja: いいえ
zh_hans: 否

# server.identity_error.autoconf_confirm.title
source: 자동 구성을 다시 실시하시겠습니까?
en: Do you want to run auto-configuration again?
ja: 自動構成を再実行しますか？
zh_hans: 是否重新执行自动配置？

# server.identity_error.autoconf_confirm.yes
source: 예
en: Yes
ja: はい
zh_hans: 是

# server.identity_error.button.autoconf
source: 자가 서명 인증서를 자동 구성하기
en: Auto-configure Self-Signed Certificate
ja: 自己署名証明書を自動構成
zh_hans: 自动配置自签名证书

# server.identity_error.button.close
source: 닫기
en: Close
ja: 閉じる
zh_hans: 关闭

# server.identity_error.button.open_keychain
source: Keychain Access 열기
en: Open Keychain Access
ja: Keychain Accessを開く
zh_hans: 打开钥匙串访问

# server.identity_error.conflicting.message
source: Keychain에서 '%@' 이름을 가진 인증서가 여러 개 발견되어 서버를 기동할 수 없습니다. Keychain Access 앱으로부터 중복된 인증서들을 제거 후 다시 서버를 기동하여 주십시오.
en: Cannot start the server because multiple certificates named '%@' were found in the Keychain. Remove the duplicate certificates from Keychain Access and start the server again.
ja: Keychainで '%@' という名前の証明書が複数見つかったため、サーバーを起動できません。 Keychain Accessアプリから重複した証明書を削除した後、サーバーを再起動してください。
zh_hans: 在钥匙串中发现多个名为 '%@' 的证书，无法启动服务器。 请从钥匙串访问应用程序中删除重复的证书后重新启动服务器。

# server.identity_error.conflicting.title
source: 중복된 이름의 서버 인증서 발견됨
en: Duplicate Server Certificates Found
ja: 重複した名前のサーバー証明書が見つかりました
zh_hans: 发现重复名称的服务器证书

# server.identity_error.not_found.message.default
source: 서버 인증서를 찾을 수 없습니다.
en: Server certificate not found.
ja: サーバー証明書が見つかりません。
zh_hans: 未找到服务器证书。

# server.identity_error.not_found.message.keychain
source: Keychain에서 '%@' 이름을 가진 서버 인증서를 찾을 수 없습니다.
en: Server certificate named '%@' not found in the Keychain.
ja: Keychainで '%@' という名前のサーバー証明書が見つかりません。
zh_hans: 在钥匙串中未找到名为 '%@' 的服务器证书。

# server.identity_error.not_found.message.pem
source: 지정된 경로에서 서버 인증서를 찾을 수 없습니다.
en: Server certificate not found at the specified path.
ja: 指定されたパスにサーバー証明書が見つかりません。
zh_hans: 在指定路径中未找到服务器证书。

# server.identity_error.not_found.title
source: 서버 인증서를 찾을 수 없음
en: Server Certificate Not Found
ja: サーバー証明書が見つかりません
zh_hans: 未找到服务器证书

# settings.about.auth_plugins.title
source: 로드된 인증 플러그인 목록
en: Loaded Auth Plugins
ja: ロードされた認証プラグイン一覧
zh_hans: 已加载的认证插件列表

# settings.about.features.title
source: 사용 가능한 기능 목록
en: Available Features
ja: 利用可能な機能一覧
zh_hans: 可用功能列表

# settings.about.footer.legal_links
source: [Noctiluca Server 사용권 계약 (EULA)](https://noctiluca.app/docs/eula/server) • [개인정보처리방침](https://noctiluca.app/docs/privacy-policy)
en: [Noctiluca Server End User License Agreement (EULA)](https://noctiluca.app/docs/eula/server) • [Privacy Policy](https://noctiluca.app/docs/privacy-policy)
ja: [Noctiluca Server 使用許諾契約 （EULA）](https://noctiluca.app/docs/eula/server) • [プライバシーポリシー](https://noctiluca.app/docs/privacy-policy)
zh_hans: [Noctiluca Server 许可协议 (EULA)](https://noctiluca.app/docs/eula/server) • [隐私政策](https://noctiluca.app/docs/privacy-policy)

# settings.about.footer.oss_notice
source: 이 소프트웨어는 오픈 소스 소프트웨어가 포함되어 있습니다. [라이선스 정보…](https://noctiluca.app/docs/open-sources/server)
en: This software includes open source software. [License Info…](https://noctiluca.app/docs/open-sources/server)
ja: このソフトウェアにはオープンソースソフトウェアが含まれています。[ライセンス情報…](https://noctiluca.app/docs/open-sources/server)
zh_hans: 本软件包含开源软件。[许可证信息…](https://noctiluca.app/docs/open-sources/server)

# settings.about.footer.sirius_protocol
source: Sirius 프로토콜의 사양 문서는 GitHub [team-unstablers/SiriusProtocol](https://github.com/team-unstablers/SiriusProtocol) 에 공개되어 있습니다.
en: The specification document for the Sirius protocol is available at GitHub [team-unstablers/SiriusProtocol](https://github.com/team-unstablers/SiriusProtocol).
ja: Siriusプロトコルの仕様書はGitHub [team-unstablers/SiriusProtocol](https://github.com/team-unstablers/SiriusProtocol) に公開されています。
zh_hans: Sirius 协议的规范文档已在 GitHub [team-unstablers/SiriusProtocol](https://github.com/team-unstablers/SiriusProtocol) 上公开。

# settings.about.header.title
source: Noctiluca Server 정보
en: About Noctiluca Server (Explicit Edition)
ja: Noctiluca Server 情報
zh_hans: Noctiluca Server (Explicit Edition) 信息

# settings.about.license_status.expired
source: 라이선스가 만료되었습니다
en: License Expired
ja: ライセンスが期限切れです
zh_hans: 许可证已过期

# settings.about.license_status.invalid
source: 아니오
en: No
ja: いいえ
zh_hans: 否

# settings.about.license_status.licensed_to
source: %@에게 라이선스됨
en: Licensed to %@
ja: %@ にライセンスされています
zh_hans: 已许可给 %@

# settings.about.license_status.title
source: 유효한 라이선스
en: Valid License
ja: 有効なライセンス
zh_hans: 有效许可证

# settings.about.license_status.trial
source: 체험판 라이선스 — %lld일 남음
en: Trial License — %lld days left
ja: トライアルライセンス — 残り %lld 日
zh_hans: 试用版许可证 — 剩余 %lld 天

# settings.about.license_status.unlicensed
source: 라이선스 없음
en: No License
ja: ライセンスなし
zh_hans: 无许可证

# settings.about.license_status.valid
source: 예
en: Yes
ja: はい
zh_hans: 是

# settings.about.license.button.purchase
source: Noctiluca Server 구매하기…
en: Purchase Noctiluca Server…
ja: Noctiluca Serverを購入する…
zh_hans: 购买 Noctiluca Server…

# settings.about.license.button.register_new
source: 새 라이선스 등록
en: Register New License
ja: 新しいライセンスを登録
zh_hans: 注册新许可证

# settings.about.license.button.remove
source: 라이선스 등록 해제
en: Remove License
ja: ライセンス登録を解除
zh_hans: 解除许可证注册

# settings.about.license.no
source: 아니오
en: No
ja: いいえ
zh_hans: 否

# settings.about.license.title
source: 유효한 라이선스
en: Valid License
ja: 有効なライセンス
zh_hans: 有效许可证

# settings.about.plugin.author
source: 개발자
en: Developer
ja: 開発者
zh_hans: 开发者

# settings.about.plugin.license
source: 라이선스
en: License
ja: ライセンス
zh_hans: 许可证

# settings.about.plugin.supported_methods
source: 지원하는 인증 메커니즘
en: Supported Auth Mechanisms
ja: サポートされる認証メカニズム
zh_hans: 支持的认证机制

# settings.about.plugin.type
source: 유형
en: Type
ja: タイプ
zh_hans: 类型

# settings.about.plugin.type_builtin
source: 내장 플러그인
en: Built-in Plugin
ja: 内蔵プラグイン
zh_hans: 内置插件

# settings.about.plugin.type_external
source: 외부 플러그인
en: External Plugin
ja: 外部プラグイン
zh_hans: 外部插件

# settings.about.plugin.version
source: 버전
en: Version
ja: バージョン
zh_hans: 版本

# settings.about.server_version.development
source: 개발 버전
en: Development Version
ja: 開発バージョン
zh_hans: 开发版本

# settings.about.server_version.title
source: Noctiluca Server 버전
en: Noctiluca Server Version
ja: Noctiluca Server バージョン
zh_hans: Noctiluca Server 版本

# settings.about.siriuskit_version.protocol_version
source: 프로토콜 버전 %@
en: Protocol Version %@
ja: プロトコルバージョン %@
zh_hans: 协议版本 %@

# settings.about.siriuskit_version.title
source: SiriusKit 버전
en: SiriusKit Version
ja: SiriusKit バージョン
zh_hans: SiriusKit 版本

# settings.about.transport_layer.title
source: 사용 가능한 트랜스포트 레이어 구현체
en: Available Transport Layer Implementations
ja: 利用可能なトランスポート層実装
zh_hans: 可用的传输层实现

# settings.general.autolaunch.global.description
source: 시스템 기동 시 자동으로 Noctiluca Server를 시작합니다.
en: Automatically starts Noctiluca Server on system startup.
ja: システム起動時にNoctiluca Serverを自動的に開始します。
zh_hans: 系统启动时自动启动 Noctiluca Server。

# settings.general.autolaunch.global.title
source: 시스템 기동 시 자동으로 Noctiluca Server 시작하기
en: Start Noctiluca Server on System Startup
ja: システム起動時にNoctiluca Serverを開始
zh_hans: 系统启动时启动 Noctiluca Server

# settings.general.autolaunch.scoped.description
source: 현재 사용자가 시스템에 로그온 시 자동으로 Noctiluca Server를 시작합니다.
en: Automatically starts Noctiluca Server when the current user logs on.
ja: 現在のユーザーがログオンした時にNoctiluca Serverを自動的に開始します。
zh_hans: 当前用户登录时自动启动 Noctiluca Server。

# settings.general.autolaunch.scoped.open_settings
source: 로그인 항목 설정 열기…
en: Open Login Items Settings…
ja: ログイン項目の設定を開く…
zh_hans: 打开登录项设置…

# settings.general.autolaunch.scoped.requires_approval
source: 시스템 설정에서 승인이 필요합니다.
en: Approval required in System Settings.
ja: システム設定で承認が必要です。
zh_hans: 需要在系统设置中批准。

# settings.general.autolaunch.scoped.title
source: 사용자 로그온 시 자동으로 Noctiluca Server 시작하기
en: Start Noctiluca Server on User Logon
ja: ユーザーログオン時にNoctiluca Serverを開始
zh_hans: 用户登录时启动 Noctiluca Server

# settings.general.autolaunch.title
source: 시스템 기동 시 자동으로 Noctiluca 시작하기
en: Start Noctiluca automatically on system startup
ja: システム起動時に自動的にNoctilucaを開始
zh_hans: 系统启动时自动启动 Noctiluca

# settings.general.autostart.description
source: Noctiluca Server 앱이 실행될 때 서버를 자동으로 시작합니다.
en: Automatically starts the server when the Noctiluca Server app is launched.
ja: Noctiluca Serverアプリ起動時にサーバーを自動的に開始します。
zh_hans: Noctiluca Server 应用启动时自动启动服务器。

# settings.general.autostart.title
source: 앱 기동 시 자동으로 서버 시작하기
en: Auto-start Server on App Launch
ja: アプリ起動時に自動的にサーバーを開始
zh_hans: 应用启动时自动启动服务器

# settings.general.autoupdate.check.description
source: 자동으로 Noctiluca Server의 업데이트를 확인합니다.
en: Automatically check for updates to Noctiluca Server.
ja: 自動的にNoctiluca Serverのアップデートを確認します。
zh_hans: 自动检查 Noctiluca Server 更新。

# settings.general.autoupdate.check.title
source: 자동으로 업데이트 확인하기
en: Automatically Check for Updates
ja: 自動的にアップデートを確認
zh_hans: 自动检查更新

# settings.general.autoupdate.download.description
source: 자동으로 Noctiluca Server의 업데이트를 다운로드합니다.
en: Automatically download updates for Noctiluca Server.
ja: 自動的にNoctiluca Serverのアップデートをダウンロードします。
zh_hans: 自动下载 Noctiluca Server 更新。

# settings.general.autoupdate.download.title
source: 자동으로 업데이트 다운로드하기
en: Automatically Download Updates
ja: 自動的にアップデートをダウンロード
zh_hans: 自动下载更新

# settings.general.elevate_scope.description
source: 실행 스코프를 시스템 레벨로 격상시키면, 모든 사용자가 Noctiluca Server를 통해 각자의 세션을 동시에 사용할 수 있게 됩니다. 하지만 이는 macOS EULA를 위반하는 행위이므로, 현재는 이 기능을 제공해드릴 수 없습니다.
en: Elevating the execution scope to the system level allows all users to use their own sessions simultaneously via Noctiluca Server. However, as this violates the macOS EULA, we cannot provide this feature at this time.
ja: 実行スコープをシステムレベルに昇格させると、すべてのユーザーがNoctiluca Serverを通じて各自のセッションを同時に使用できるようになります。 しかし、これはmacOSの使用許諾契約（EULA）に違反するため、現在この機能は提供できません。
zh_hans: 将执行范围提升至系统级别允许所有用户通过 Noctiluca Server 同时使用各自的会话。 但是，由于这违反了 macOS EULA，我们目前无法提供此功能。

# settings.general.elevate_scope.title
source: Noctiluca Server의 실행 스코프를 시스템 레벨으로 격상시키기
en: Elevate Noctiluca Server Execution Scope to System Level
ja: 実行スコープをシステムレベルに昇格
zh_hans: 将执行范围提升至系统级别

# settings.general.max_concurrent_sessions.description
source: Noctiluca가 허용할 최대 동시 접속 수를 설정합니다.
en: Sets the maximum number of concurrent sessions allowed by Noctiluca.
ja: Noctilucaが許可する最大同時接続数を設定します。
zh_hans: 设置 Noctiluca 允许的最大并发连接数。

# settings.general.max_concurrent_sessions.title
source: 최대 동시 접속 수
en: Max Concurrent Sessions
ja: 最大同時接続数
zh_hans: 最大并发会话数

# settings.general.maybe-removed.title
source: 어쩌면 삭제될 수도 있는 기능들
en: Features That May Be Removed
ja: 削除される可能性のある機能
zh_hans: 可能会被移除的功能

# settings.general.title
source: 일반
en: General
ja: 一般
zh_hans: 常规

# settings.misc.connectivity_test.description
source: 주식회사 팀언스테이블러즈에서 제공하는 테스트 노드를 통해 외부로부터 접속이 가능한지 테스트합니다.
en: Tests if external access is possible through a test node provided by team unstablers Inc.
ja: 株式会社Team Unstablersが提供するテストノードを通じて、外部からの接続が可能かテストします。
zh_hans: 通过 Team Unstablers Inc. 提供的测试节点测试是否可以从外部连接。

# settings.misc.connectivity_test.request
source: 접속 테스트 요청하기
en: Request Connectivity Test
ja: 接続テストをリクエスト
zh_hans: 请求连接测试

# settings.misc.connectivity_test.title
source: 외부 접속 테스트
en: External Connectivity Test
ja: 外部接続テスト
zh_hans: 外部连接测试

# settings.misc.diagnostics.export.save_to_file
source: 파일로 저장…
en: Save to File…
ja: ファイルに保存…
zh_hans: 保存为文件…

# settings.misc.diagnostics.export.title
source: 진단 정보 내보내기
en: Export Diagnostics
ja: 診断情報のエクスポート
zh_hans: 导出诊断信息

# settings.misc.logging.enable_file_logging.description
source: 접속/접속 해제 등 주요 이벤트를 ~/Library/Logs에 파일로 기록합니다.
en: Saves logs to files in ~/Library/Logs.
ja: 接続/切断など主要なイベントを ~/Library/Logs にファイルとして記録します。
zh_hans: 将日志作为文件保存到 ~/Library/Logs。

# settings.misc.logging.enable_file_logging.title
source: 파일 로깅 활성화
en: Enable File Logging
ja: ファイルロギング有効化
zh_hans: 启用文件日志记录

# settings.misc.logging.enable_log_rotation.description
source: 로그 파일이 일정 크기를 초과하면 자동으로 새 파일로 전환합니다.
en: Automatically rotates to a new file when the log file exceeds a certain size.
ja: ログファイルが一定サイズを超えた場合、自動的に新しいファイルに切り替えます。
zh_hans: 当日志文件超过一定大小时，自动切换到新文件。

# settings.misc.logging.enable_log_rotation.title
source: 로그 로테이션 활성화
en: Enable Log Rotation
ja: ログローテーション有効化
zh_hans: 启用日志轮替

# settings.misc.logging.max_file_count.title
source: 최대 파일 수
en: Max File Count
ja: 最大ファイル数
zh_hans: 最大文件数

# settings.misc.logging.max_file_size.title
source: 최대 파일 크기 (MB)
en: Max File Size (MB)
ja: 最大ファイルサイズ （MB）
zh_hans: 最大文件大小 (MB)

# settings.misc.logging.minimum_log_level.title
source: 최소 로그 레벨
en: Minimum Log Level
ja: 最小ログレベル
zh_hans: 最低日志级别

# settings.misc.logging.open_log_folder.action
source: Finder에서 열기
en: Open in Finder
ja: Finderで開く
zh_hans: 在访达中打开

# settings.misc.logging.open_log_folder.title
source: 로그 파일 위치
en: Log File Location
ja: ログファイルの場所
zh_hans: 日志文件位置

# settings.misc.logging.title
source: 이벤트 로깅
en: Logging
ja: イベントロギング
zh_hans: 日志记录

# settings.misc.telemetry.enable.description
source: Noctiluca Server가 가동 중 오류가 발생하거나, 비정상적으로 종료되었을 때 오류 보고를 익명으로 수집하는 것을 허용합니다. 프라이버시 보호를 우선하기 위해, 이 옵션은 기본적으로 꺼져 있습니다. [더 알아보기…](https://noctiluca.app/docs/server/about-telemetry)
en: Allows anonymous collection of user environment and usage statistics. To prioritize privacy protection, this option is off by default. [Learn more…](https://noctiluca.app/docs/server/about-telemetry)
ja: ユーザー環境および使用統計を匿名で収集することを許可します。 プライバシー保護を優先するため、このオプションはデフォルトでオフになっています。[詳細…](https://noctiluca.app/docs/server/about-telemetry)
zh_hans: 允许匿名收集用户环境和使用统计信息。 为了优先保护隐私，此选项默认处于关闭状态。[了解更多…](https://noctiluca.app/docs/server/about-telemetry)

# settings.misc.telemetry.enable.title
source: Noctiluca의 개발을 익명으로 돕기
en: Help Noctiluca Development Anonymously
ja: Noctilucaの開発を匿名で支援する
zh_hans: 匿名帮助 Noctiluca 开发

# settings.misc.telemetry.identifier.description
source: 이 텔레메트리 식별자는 UUIDv4 형식으로 생성된 것입니다. 사용자를 특정짓거나 추적하는 데 사용되지 않으며, 단지 수집된 오류 보고 데이터가 서로 다른 사용자로부터 왔는지를 구분하는 데에만 사용됩니다.
en: This telemetry identifier is generated in UUIDv4 format. It is not used to identify or track you; it is only used to distinguish whether collected error reports originated from different users.
ja: このテレメトリ識別子はUUIDv4形式で生成されたものです。ユーザーを特定・追跡するために使用されることはなく、 収集されたエラー報告が異なるユーザーからのものかを区別するためにのみ使用されます。
zh_hans: 此遥测标识符以 UUIDv4 格式生成，不会用于识别或追踪用户， 仅用于区分所收集的错误报告是否来自不同的用户。

# settings.misc.telemetry.identifier.reset
source: 식별자 재설정
en: Reset Identifier
ja: 識別子をリセット
zh_hans: 重置标识符

# settings.misc.telemetry.identifier.title
source: 텔레메트리 식별자
en: Telemetry Identifier
ja: テレメトリ識別子
zh_hans: 遥测标识符

# settings.misc.telemetry.title
source: 텔레메트리 및 진단 정보
en: Telemetry and Diagnostics
ja: テレメトリと診断情報
zh_hans: 遥测及诊断信息

# settings.misc.transport_layer_implemenation.apple_quic.description
source: macOS에서 기본으로 제공되는 Apple의 QUIC 구현체를 사용합니다. 일부 기능이 제대로 동작하지 않거나, 낮은 성능을 낼 수 있습니다.
en: Uses Apple's QUIC implementation provided by default in macOS. Some features may not work properly, or performance may be low.
ja: macOS標準のApple製QUIC実装を使用します。 一部の機能が正常に動作しなかったり、性能が低下したりする可能性があります。
zh_hans: 使用 macOS 默认提供的 Apple QUIC 实现。 部分功能可能无法正常工作，或性能较低。

# settings.misc.transport_layer_implemenation.apple_quic.display_name
source: QUIC (Network.framework) **(권장하지 않음)**
en: QUIC (Network.framework) **(Not Recommended)**
ja: QUIC （Network.framework） **（非推奨）**
zh_hans: QUIC (Network.framework) **(不推荐)**

# settings.misc.transport_layer_implemenation.msquic.description
source: 오픈 소스 QUIC 구현체를 사용합니다.
en: Uses an open source QUIC implementation.
ja: オープンソースのQUIC実装を使用します。
zh_hans: 使用开源 QUIC 实现。

# settings.misc.transport_layer_implementation.description
source: 서버 가동 시 사용할 트랜스포트 레이어 구현체를 선택합니다. 구현체에 따라 성능이나 세부 동작이 다를 수 있습니다.
en: Selects the transport layer implementation to use when starting the server. Performance or detailed behavior may vary depending on the implementation.
ja: サーバー稼働時に使用するトランスポート層の実装を選択します。実装によって性能や詳細な動作が異なる場合があります。
zh_hans: 选择服务器运行时使用的传输层实现。根据实现的不同，性能或详细行为可能会有所不同。

# settings.misc.transport_layer_implementation.oss_notice
source: **오픈 소스 고지**: Noctiluca 제품군에서는 MsQuic에 다음과 같은 수정을 가하여 사용하고 있습니다: - Swift 언어에서 쉽게 사용할 수 있도록 [`swift-msquic`](https://github.com/team-unstablers/swift-msquic) 래퍼 모듈을 작성하였습니다. - iOS에서 [`dlopen(3)`](https://man.freebsd.org/cgi/man.cgi?dlopen(3))을 사용하지 않도록 수정하였습니다. 수정을 가한 포크 버전은 GitHub [team-unstablers/msquic](https://github.com/team-unstablers/msquic) 에 공개되어 있습니다.
en: **Open Source Notice**: The Noctiluca family uses MsQuic with the following modifications: - Written [`swift-msquic`](https://github.com/team-unstablers/swift-msquic) wrapper module for easy use in Swift. - Modified to avoid using [`dlopen(3)`](https://man.freebsd.org/cgi/man.cgi?dlopen(3)) on iOS. The modified fork is available at GitHub [team-unstablers/msquic](https://github.com/team-unstablers/msquic).
ja: **オープンソースに関する通知**: Noctiluca製品群では、MsQuicに以下の修正を加えて使用しています: - Swift言語から容易に利用できるように [`swift-msquic`](https://github.com/team-unstablers/swift-msquic) ラッパーモジュールを作成しました。 - iOSで [`dlopen(3)`](https://man.freebsd.org/cgi/man.cgi?dlopen(3)) を使用しないように修正しました。修正を加えたフォーク版はGitHub [team-unstablers/msquic](https://github.com/team-unstablers/msquic) で公開されています。
zh_hans: **开源声明**：Noctiluca 产品系列对 MsQuic 进行了以下修改并使用： - 编写了 [`swift-msquic`](https://github.com/team-unstablers/swift-msquic) 封装模块，以便在 Swift 语言中轻松使用。 - 修改为在 iOS 上不使用 [`dlopen(3)`](https://man.freebsd.org/cgi/man.cgi?dlopen(3))。修改后的 Fork 版本已在 GitHub [team-unstablers/msquic](https://github.com/team-unstablers/msquic) 上公开。

# settings.misc.transport_layer_implementation.title
source: 트랜스포트 레이어 구현체
en: Transport Layer Implementation
ja: トランスポート層の実装
zh_hans: 传输层实现

# settings.misc.transport_layer_misc.title
source: 기타 트랜스포트 레이어 설정
en: Misc Transport Layer Settings
ja: その他のトランスポート層設定
zh_hans: 其他传输层设置

# settings.notification.enabled.description
source: 이벤트 발생 시 알림을 표시합니다.
en: Show notifications when events occur.
ja: イベント発生時に通知を表示します。
zh_hans: 发生事件时显示通知。

# settings.notification.enabled.title
source: 알림 표시하기
en: Show Notifications
ja: 通知を表示する
zh_hans: 显示通知

# settings.notification.on_connect
source: 사용자가 접속했을 때
en: When User Connects
ja: ユーザーが接続したとき
zh_hans: 用户连接时

# settings.notification.on_disconnect
source: 사용자가 접속을 종료했을 때
en: When User Disconnects
ja: ユーザーが接続を終了したとき
zh_hans: 用户断开连接时
